/*
Задание №1
Написать функцию, которая выводит в консоль кубы первых 10 натуральных чисел.

Довавьте в написанную функию параметр n, чтобы она выводила кубы n первых первых натуральных чисел. 

Задание №2
Напишите функцию, которая вычисляет объем цилиндра.
Ее параметрами должны быть радус и высота, которые вводятся с клавиатуры.

Задание №3
Напишите функцию min(a, b), вычисляющую минимум двух чисел.
Затем напишите функцию min4(a, b, c, d), вычисляющую минимум 4 чисел с помощью функции min.
Считайте четыре целых числа из консоли и выведите их минимум.
Тестовые данные				Ожидаемый результат
1 2 3 4						1
4 3 2 1						1
9 5 1 7						1
7 3 5 9						3

Задание №4
Добавить в проект файл Date.hpp
Реализовать функции которые объявлены в файле Date.hpp
При выполнении задания можно использовать свои вспомогательные функции.
Продемонстрировать работы всех написанных функций в main().
